{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"outputs": {"MobilenetV1/Predictions/Reshape_1": {"name": "MobilenetV1/Predictions/Reshape_1"}}}}, "modelTopology": {"node": [{"name": "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "op": "_FusedConv2D", "input": ["input", "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_weights", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "MobilenetV1/Logits/AvgPool_1a/AvgPool", "op": "AvgPool", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6"], "attr": {"ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd", "op": "_FusedConv2D", "input": ["MobilenetV1/Logits/AvgPool_1a/AvgPool", "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "MobilenetV1/Logits/Conv2d_1c_1x1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "MobilenetV1/Logits/SpatialSqueeze", "op": "Squeeze", "input": ["MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd"], "attr": {"squeeze_dims": {"list": {"i": ["1", "2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Predictions/Softmax", "op": "Softmax", "input": ["MobilenetV1/Logits/SpatialSqueeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Predictions/Shape", "op": "Shape", "input": ["MobilenetV1/Logits/SpatialSqueeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "MobilenetV1/Predictions/Reshape_1", "op": "Reshape", "input": ["MobilenetV1/Predictions/Softmax", "MobilenetV1/Predictions/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "shape": [1, 1, 256, 2], "dtype": "float32"}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/biases", "shape": [2], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_weights", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_bn_offset", "shape": [8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_bn_offset", "shape": [8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_weights", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_weights", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_weights", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_weights", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_weights", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_weights", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_weights", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}]}]}